# Brewfile for macOS package management

# System
brew "bash"
brew "curl"
brew "gh"
brew "gnupg"
brew "grep"
brew "pkg-config"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"

# Programming #1
brew "dotnet"
brew "go"
brew "node"
brew "openjdk"
brew "php"
brew "python"
brew "python-setuptools"
brew "ruby"
brew "rust"

# Programming #2
brew "awscli"
brew "composer"
cask "gcloud-cli"
brew "git"
brew "git-lfs"
brew "kotlin"
brew "npm"
brew "pipx"
brew "rbenv"
brew "sqlite"
brew "uv"
brew "vim"
brew "watchman"
brew "xcodes"
brew "yarn"

# AI Tools
brew "gemini-cli"
cask "cursor"
cask "claude"
brew "claude-squad"
brew "ollama"
cask "windsurf"

# Development Apps
cask "docker"
cask "figma"
cask "flutter"
cask "github"
cask "postman"
cask "proxyman"
cask "visual-studio-code"

# Jetbrains
cask "jetbrains-toolbox"
cask "android-studio"
cask "pycharm"
cask "goland"
cask "phpstorm"
cask "datagrip"

# Other Apps
cask "appcleaner"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "keka"
cask "rectangle"
cask "slack"
cask "stats"
cask "zoom"
